# -- coding: utf-8 --

'''Напишите программу, которая считывает три числа и выводит их сумму.
Каждое число записано в отдельной строке.'''

def s(a, b, c):
    return a+b+c

d, f, g = int(input()), int(input()), int(input())

print(s(d, f, g))
